app/controllers/sessions_controller.rb

	def create
		p params
		@user = User.find_by(email: session_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1