app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "city", "state", "zip", "st_num", "st_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
	def create
		@user = User.new(users_params)
		@user.avatar = @user.create_gravatar_url